<template>
  <div class="content-wrapper">
  <div class="content">
    <router-link :to="{name:'login'}">На страницу авторизации</router-link>
    <router-link :to="{name:'Home'}">На главную страницу</router-link>

    <div class="version">
      <h3>1.0.7(не в релизе)</h3>
      <ul>
        <li>Реалезована система</li>
      </ul>
    </div>

    <div class="version">
      <h3>1.0.6</h3>
      <ul>
        <li>Исправлен баг с дублированием ключей в компоненте таблицы и немного переработан код компонента</li>
        <li>Переработана система статусов для заявки</li>
        <li>Фикс отображения контактов пользователя в заявке, в админке</li>
        <li>В случае если файл является изображением, в админке, в заявке будет отображено превью изображения, иначе стандартная иконка файлов</li>
        <li>К посылаемой на сервер информации о файле в заявке добавлено поле сообщающее является ли файл изображенем</li>
      </ul>
    </div>
      <h3>1.0.5</h3>
      <ul>
        <li>Фиксы стилей навигации для мобильных экранов</li>
        <li>Фиксы стилей футера</li>
        <li>Фиксы наименований в компоненте таблицы</li>
        <li>Изменен интерфейс меню профиля пользователя, полностью переместившись из меню на странице профиля</li>
        <li>Добавлен скрипт сканирующий папки, удаляя не подтвержденные файлы. На данный момент сканирует только папки старше недели. Выполняется раз в день.</li>
        <li>Подключенена библиотека cron, позволяющая запускать задачи по расписсанию</li>
      </ul>
    </div>
    <div class="version">
      <h3>1.0.4</h3>
      <ul>
        <li>Добавлен анализатор файлов при сохранении заявки, проверяющий файлы в заявке и файлы в целевой папке, удаляя лишние.</li>
        <li>После завершения анализа файлов формируется специальный файл, наличие которого говорит о том, что информация в папке проверена. (загатовка перед созданием автоматического сборщика мусора)</li>
        <li>Фиксы стилей футера при уменьшении экрана</li>
      </ul>
    </div>
    <div class="version">
      <h3>1.0.3</h3>
      <ul>
        <li>Получение дополнительной информации о пользователе отославшего файл</li>
        <li>Стилизация компонента для работы с файлами в админке</li>
        <li>Работа с файлами в админке выделена в отдельный компонент</li>
      </ul>
    </div>
    <div class="version">
      <h3>1.0.2</h3>
      <ul>
        <li>Фиксы стилей мобильной версии</li>
        <li>Добавление промежуточных обработчиков на роуты, для проверки прав доступа</li>
        <li>Добавлена валидация данных на странице контактов</li>
        <li>Добавление справочной информации</li>
      </ul>
    </div>
    <div class="version">
      <h3>1.0.1</h3>
      <ul>
        <li>Глобальные правки элементов, текста и стилей главной страницы</li>
      </ul>
    </div>
    <div class="version">
      <h3>1.0.0</h3>
      <ul>
        <li>Релиз</li>
      </ul>
    </div>

  </div>
  </div>
</template>

<script>
export default {
name: "NoLogin"
}
</script>

<style scoped>
  h3{
    margin:0;
  }
  .version{
    margin-top:20px;
  }
</style>

